["FUNCTION: Plays a pivotal role in cell survival by repairing damaged DNA in a p53/TP53-dependent manner. Supplies deoxyribonucleotides for DNA repair in cells arrested at G1 or G2. Contains an iron-tyrosyl free radical center required for catalysis. Forms an active ribonucleotide reductase (RNR) complex with RRM1 which is expressed both in resting and proliferating cells in response to DNA damage (By similarity). {ECO:0000250}.", "FUNCTION: Catalyzes the transfer of a dimethylallyl group onto the adenine at position 37 in tRNAs that read codons beginning with uridine, leading to the formation of N6-(dimethylallyl)adenosine (i(6)A). Involved in the cis-type cytokinin biosynthesis. {ECO:0000269|PubMed:11999372, ECO:0000269|PubMed:17062755}.", "FUNCTION: 3'-to-5' exoribonuclease specific for small oligoribonucleotides. {ECO:0000255|HAMAP-Rule:MF_00045}.", "FUNCTION: Catalyzes the base-exchange of a guanine (G) residue with the queuine precursor 7-aminomethyl-7-deazaguanine (PreQ1) at position 34 (anticodon wobble position) in tRNAs with GU(N) anticodons (tRNA-Asp, -Asn, -His and -Tyr). Catalysis occurs through a double-displacement mechanism. The nucleophile active site attacks the C1' of nucleotide 34 to detach the guanine base from the RNA, forming a covalent enzyme-RNA intermediate. The proton acceptor active site deprotonates the incoming PreQ1, allowing a nucleophilic attack on the C1' of the ribose to form the product. After dissociation, two additional enzymatic reactions on the tRNA convert PreQ1 to queuine (Q), resulting in the hypermodified nucleoside queuosine (7-(((4,5-cis-dihydroxy-2-cyclopenten-1-yl)amino)methyl)-7-deazaguanosine). {ECO:0000255|HAMAP-Rule:MF_00168}.", "FUNCTION: Together with the chaperonin GroEL, plays an essential role in assisting protein folding. The GroEL-GroES system forms a nano-cage that allows encapsulation of the non-native substrate proteins and provides a physical environment optimized to promote and accelerate protein folding. GroES binds to the apical surface of the GroEL ring, thereby capping the opening of the GroEL channel. {ECO:0000255|HAMAP-Rule:MF_00580}.", "FUNCTION: Involved in the biosynthesis of isoprenoids. Catalyzes the 1,3-allylic rearrangement of the homoallylic substrate isopentenyl (IPP) to its allylic isomer, dimethylallyl diphosphate (DMAPP). {ECO:0000255|HAMAP-Rule:MF_00354}.", "FUNCTION: Class-III ADH is remarkably ineffective in oxidizing ethanol, but it readily catalyzes the oxidation of long-chain primary alcohols and the oxidation of S-(hydroxymethyl) glutathione. {ECO:0000269|PubMed:8643621}.", "FUNCTION: RNA chaperone with significant RNA binding, RNA strand exchange and RNA duplexing activities. May regulate ProP activity through an RNA-based, post-transcriptional mechanism. {ECO:0000255|HAMAP-Rule:MF_00749}.", "FUNCTION: Nucleotidyltransferase involved in the post-translational modification of proteins. It can catalyze the addition of adenosine monophosphate (AMP) or uridine monophosphate (UMP) to a protein, resulting in modifications known as AMPylation and UMPylation. {ECO:0000255|HAMAP-Rule:MF_00692}.", "FUNCTION: Plays a role in virus cell tropism, and may be required for efficient virus replication in macrophages (PubMed:11238833). In addition, inhibits IFN-beta-induced IFN-stimulated genes (ISGs) transcription. Mechanistically, degrades host STAT1 and STAT2 through apoptosis and ubiquitin-proteasome pathways respectively (PubMed:35076286). {ECO:0000269|PubMed:11238833, ECO:0000269|PubMed:35076286}.", "FUNCTION: ATPase involved in transcriptional activation and repression of select genes by chromatin remodeling (alteration of DNA-nucleosome topology). Component of SWI/SNF chromatin remodeling complexes that carry out key enzymatic activities, changing chromatin structure by altering DNA-histone contacts within a nucleosome in an ATP-dependent manner (PubMed:19081374). Component of the CREST-BRG1 complex, a multiprotein complex that regulates promoter activation by orchestrating the calcium-dependent release of a repressor complex and the recruitment of an activator complex. In resting neurons, transcription of the c-FOS promoter is inhibited by SMARCA4-dependent recruitment of a phospho-RB1-HDAC repressor complex. Upon calcium influx, RB1 is dephosphorylated by calcineurin, which leads to release of the repressor complex. At the same time, there is increased recruitment of CREBBP to the promoter by a CREST-dependent mechanism, which leads to transcriptional activation. The CREST-BRG1 complex also binds to the NR2B promoter, and activity-dependent induction of NR2B expression involves the release of HDAC1 and recruitment of CREBBP (PubMed:19081374). Belongs to the neural progenitors-specific chromatin remodeling complex (npBAF complex) and the neuron-specific chromatin remodeling complex (nBAF complex). During neural development, a switch from a stem/progenitor to a postmitotic chromatin remodeling mechanism occurs as neurons exit the cell cycle and become committed to their adult state. The transition from proliferating neural stem/progenitor cells to postmitotic neurons requires a switch in subunit composition of the npBAF and nBAF complexes. As neural progenitors exit mitosis and differentiate into neurons, npBAF complexes which contain ACTL6A/BAF53A and PHF10/BAF45A, are exchanged for homologous alternative ACTL6B/BAF53B and DPF1/BAF45B or DPF3/BAF45C subunits in neuron-specific complexes (nBAF). The npBAF complex is essential for the self-renewal/proliferative capacity of the multipotent neural stem cells. The nBAF complex along with CREST plays a role regulating the activity of genes essential for dendrite growth. SMARCA4/BAF190A may promote neural stem cell self-renewal/proliferation by enhancing Notch-dependent proliferative signals, while concurrently making the neural stem cell insensitive to SHH-dependent differentiating cues. Acts as a corepressor of ZEB1 to regulate E-cadherin transcription and is required for induction of epithelial-mesenchymal transition (EMT) by ZEB1 (By similarity). Binds via DLX1 to enhancers located in the intergenic region between DLX5 and DLX6 and this binding is stabilized by the long non-coding RNA (lncRNA) Evf2 (By similarity). Binds to RNA in a promiscuous manner (By similarity). Binding to RNAs including lncRNA Evf2 leads to inhibition of SMARCA4 ATPase and chromatin remodeling activities (By similarity). {ECO:0000250|UniProtKB:P51532, ECO:0000250|UniProtKB:Q3TKT4, ECO:0000269|PubMed:19081374}.", "FUNCTION: Part of the outer membrane protein assembly complex, which is involved in assembly and insertion of beta-barrel proteins into the outer membrane. {ECO:0000255|HAMAP-Rule:MF_00924}.", "FUNCTION: Hybrid PKS-NRPS synthetase; part of the gene cluster that mediates the biosynthesis of the trans-fused decalin-containing tetramic acid phomasetin, the stereochemical opposite of the HIV-1 integrase inhibitor equisetin (PubMed:29972614). The PKS module of phm1 together with the enoylreductase phm4 catalyze the formation of the polyketide unit which is then conjugated to L-serine by the condensation domain of the phm1 NRPS module (PubMed:29972614). Activity of the Dieckmann cyclase domain (RED) of phm1 results in release of the Dieckmann product intermediate (PubMed:29972614). The Diels-Alderase phm7 then uses the Dieckmann product of phm1 as substrate and catalyzes the Diels-Alder cycloaddition to form the decalin ring of N-desmethylphomasetin (PubMed:29972614, PubMed:34121297). N-desmethylphomasetin is further methylated to phomasetin by the methyltransferase phm5 (PubMed:29972614). {ECO:0000269|PubMed:29972614, ECO:0000269|PubMed:34121297}.", "FUNCTION: This is one of the proteins that bind and probably mediate the attachment of the 5S RNA into the large ribosomal subunit, where it forms part of the central protuberance. {ECO:0000255|HAMAP-Rule:MF_01337}.", "FUNCTION: E3 ubiquitin-protein ligase that is essential for proper development of the forebrain, the eye, and the face. Catalyzes monoubiquitination of serine/threonine-protein phosphatase 2A (PP2A) catalytic subunit PPP2CA/PPP2CB (By similarity). Negatively regulates nitric oxide production by inducing NOS1 and NOS3 translocation to actin cytoskeleton and inhibiting their enzymatic activity (By similarity). {ECO:0000250|UniProtKB:Q9D6T0, ECO:0000250|UniProtKB:Q9Y314}.", "FUNCTION: ATP-dependent RNA helicase. Involved in pre-mRNA splicing as component of the spliceosome. Core component of the splicing-dependent multiprotein exon junction complex (EJC) deposited at splice junctions on mRNAs. The EJC is a dynamic structure consisting of core proteins and several peripheral nuclear and cytoplasmic associated factors that join the complex only transiently either during EJC assembly or during subsequent mRNA metabolism. The EJC marks the position of the exon-exon junction in the mature mRNA for the gene expression machinery and the core components remain bound to spliced mRNAs throughout all stages of mRNA metabolism thereby influencing downstream processes including nuclear mRNA export, subcellular mRNA localization, translation efficiency and nonsense-mediated mRNA decay (NMD). Its RNA-dependent ATPase and RNA-helicase activities are induced by CASC3, but abolished in presence of the MAGOH-RBM8A heterodimer, thereby trapping the ATP-bound EJC core onto spliced mRNA in a stable conformation. The inhibition of ATPase activity by the MAGOH-RBM8A heterodimer increases the RNA-binding affinity of the EJC. Involved in translational enhancement of spliced mRNAs after formation of the 80S ribosome complex. Binds spliced mRNA in sequence-independent manner, 20-24 nucleotides upstream of mRNA exon-exon junctions. Shows higher affinity for single-stranded RNA in an ATP-bound core EJC complex than after the ATP is hydrolyzed. Involved in the splicing modulation of BCL2L1/Bcl-X (and probably other apoptotic genes); specifically inhibits formation of proapoptotic isoforms; the function is different from the established EJC assembly. Involved in craniofacial development. {ECO:0000250|UniProtKB:P38919}.", "FUNCTION: Involved in unsaturated fatty acids biosynthesis. Catalyzes the dehydration of short chain beta-hydroxyacyl-ACPs and long chain saturated and unsaturated beta-hydroxyacyl-ACPs. {ECO:0000255|HAMAP-Rule:MF_00406}.", "FUNCTION: Toxic component of a type I toxin-antitoxin (TA) system; overexpression in the absence of cognate antisense antitoxin SR5 RNA leads to cell lysis (PubMed:26565032, PubMed:26940229). Base pairing occurs between the 3' UTRs of bsrE mRNA and SR5 RNA which leads to bsrE mRNA degradation initiated by RNase III (rnc) and RNase J1 (rnjA) (PubMed:26940229). Genetic evidence suggests an unidentified RNA-binding protein may exist that promotes TA RNA interaction (PubMed:26565032). {ECO:0000269|PubMed:26565032, ECO:0000269|PubMed:26940229}.", "FUNCTION: Responsible for synthesis of pseudouridine from uracil-13 in transfer RNAs. {ECO:0000255|HAMAP-Rule:MF_01082}.", "FUNCTION: Increases the formation of ribosomal termination complexes and stimulates activities of RF-1 and RF-2. It binds guanine nucleotides and has strong preference for UGA stop codons. It may interact directly with the ribosome. The stimulation of RF-1 and RF-2 is significantly reduced by GTP and GDP, but not by GMP (By similarity). {ECO:0000250}.", "FUNCTION: Subunit of the 11S REG (also called PA28) proteasome regulator, a doughnut-shaped homoheptamer which associates with the proteasome. 11S REG-gamma activates preferentially the trypsin-like catalytic subunit of the proteasome. May also be involved in cell cycle regulation. {ECO:0000269|PubMed:19411624}.", "FUNCTION: Binds directly to 23S rRNA. The L1 stalk is quite mobile in the ribosome, and is involved in E site tRNA release. {ECO:0000255|HAMAP-Rule:MF_01318}.; FUNCTION: Protein L1 is also a translational repressor protein, it controls the translation of the L11 operon by binding to its mRNA. {ECO:0000255|HAMAP-Rule:MF_01318}.", "FUNCTION: Exhibits a very high intrinsic GTPase hydrolysis rate. Involved in the addition of a carboxymethylaminomethyl (cmnm) group at the wobble position (U34) of certain tRNAs, forming tRNA-cmnm(5)s(2)U34. {ECO:0000255|HAMAP-Rule:MF_00379}.", "FUNCTION: Catalyzes the attachment of proline to tRNA(Pro) in a two-step reaction: proline is first activated by ATP to form Pro-AMP and then transferred to the acceptor end of tRNA(Pro). As ProRS can inadvertently accommodate and process non-cognate amino acids such as alanine and cysteine, to avoid such errors it has two additional distinct editing activities against alanine. One activity is designated as 'pretransfer' editing and involves the tRNA(Pro)-independent hydrolysis of activated Ala-AMP. The other activity is designated 'posttransfer' editing and involves deacylation of mischarged Ala-tRNA(Pro). The misacylated Cys-tRNA(Pro) is not edited by ProRS. {ECO:0000255|HAMAP-Rule:MF_01569}.", "FUNCTION: Located at the top of the head of the 30S subunit, it contacts several helices of the 16S rRNA. In the 70S ribosome it contacts the 23S rRNA (bridge B1a) and protein L5 of the 50S subunit (bridge B1b), connecting the 2 subunits; these bridges are implicated in subunit movement. Contacts the tRNAs in the A and P-sites. {ECO:0000255|HAMAP-Rule:MF_01315}.", "FUNCTION: Catalyzes the transfer of an acetyl group from acetyl-CoA to tetrahydrodipicolinate. {ECO:0000255|HAMAP-Rule:MF_01691}.", "FUNCTION: Catalyzes the interconversion of 2-phosphoglycerate and 3-phosphoglycerate. {ECO:0000255|HAMAP-Rule:MF_01402}.", "FUNCTION: Catalyzes the synthesis of GMP from XMP. {ECO:0000255|HAMAP-Rule:MF_00344}.", "FUNCTION: Degrades exclusively diarylether compounds having carboxyl groups in the 3- or 4-position. Yields a hemiacetal that spontaneously hydrolyzes to phenol and protocatechuate.", "FUNCTION: Multifunctional RNA-binding protein involved in the regulation of pre-mRNA splicing, mRNA stability and mRNA translation important for cell fate decision and differentiation. Plays a major role in pre-mRNA alternative splicing regulation. Mediates preferentially muscle-specific exon inclusion in numerous mRNAs important for striated cardiac and skeletal muscle cell differentiation. Binds to intronic splicing enhancer (ISE) composed of stretches of GU-rich motifs localized in flanking intron of exon that will be included by alternative splicing. Involved in embryonic stem cell (ESC) transition to cardiac cell differentiation by promoting pre-mRNA alternative splicing events of several pluripotency and/or differentiation genes. Plays a role in the regulation of mRNA stability and mRNA translation to which it is bound. Involved in myogenic differentiation by regulating myog levels. Binds to a huge amount of mRNAs. Required for embryonic heart development, sarcomer and M-band formation in striated muscles. {ECO:0000250|UniProtKB:D3Z4I3, ECO:0000250|UniProtKB:Q9BX46}.", "FUNCTION: Involved in CDC48-dependent protein degradation through the ubiquitin/proteasome pathway. Involved in delivery of substrates to the 26S proteasome. Also required for membrane fusion and sporulation. {ECO:0000269|PubMed:15120077, ECO:0000269|PubMed:16303567}.", "FUNCTION: Binds the lower part of the 30S subunit head. Binds mRNA in the 70S ribosome, positioning it for translation. {ECO:0000255|HAMAP-Rule:MF_01309}.", "FUNCTION: FAD-dependent monooxygenase; part of the gene cluster that mediates the biosynthesis of pyranterreones, a family of antioxidative compounds (PubMed:32077283). The first step of pyranonigrins biosynthesis is performed by the hybrid PKS-NRPS synthetase pytA that condenses 4 malonyl-CoA units ato the acetyl starter unit by the modular PKS of pytA (PubMed:32077283). The acyl chain is then connected to an L-serine through the amide bond by the modular NRPS of pytA (PubMed:32077283). A tetramic acid is formed and released from the PKS-NRPS pytA to give pyranterreone 5 with the help of the thioesterase pytI (PubMed:32077283). Pyranterreone 5 could be methylated by pytC to afford pyranterreone 6 (Probable). Both pyranterreones 5 and 6 are subsequently oxidized by the FAD-linked oxidoreductase pytB and the cytochrome P450 monooxygenase pytD to form the fused gamma-pyrone core, resulting in pyranterreones 7 and 11, respectively (PubMed:32077283). The hydroxy group at C-8 of pyranterreones 7 and 11 are dehydrated by the aspartyl protease pytH to form a delta-7 double bond to give pyranterreones 3 and 1, 2 accordingly (PubMed:32077283). The exo-methylene of pyranterreone 3 could be reduced into a pendant methyl by reductase pytE to provide pyranterreone 4, also known as cordylactam (Probable). Pyranterreone 4 can be reconverted to pyranterreone 3 through pytB-catalyzed dehydrogenation or further oxidized to pyranterreones 9 and 10 (Probable). {ECO:0000269|PubMed:32077283, ECO:0000305|PubMed:32077283}.", "FUNCTION: TRAP proteins are part of a complex whose function is to bind calcium to the ER membrane and thereby regulate the retention of ER resident proteins. {ECO:0000250}.", "FUNCTION: Essential component of the TIM23 complex, a complex that mediates the translocation of transit peptide-containing proteins across the mitochondrial inner membrane. Required to direct preproteins in transit and direct them to the channel protein TIM23, and possibly facilitates transfer of the translocating proteins from the TOM complex to the TIM23 complex (By similarity). {ECO:0000250}.", "FUNCTION: Chaperone involved in the correct folding and assembly of outer membrane proteins. Recognizes specific patterns of aromatic residues and the orientation of their side chains, which are found more frequently in integral outer membrane proteins. May act in both early periplasmic and late outer membrane-associated steps of protein maturation. {ECO:0000255|HAMAP-Rule:MF_01183}.", "FUNCTION: ATP-dependent RNA helicase involved in 40S ribosomal subunit biogenesis. Required for the processing and cleavage of 35S pre-rRNA at sites A0, A1, and A2, leading to mature 18S rRNA.", "FUNCTION: Required for proper assembly of pre-ribosomal particles during the biogenesis of the 60S ribosomal subunit. {ECO:0000255|HAMAP-Rule:MF_03163}.", "FUNCTION: Required for the import of both fatty acids and cholesterol during growth in macrophages and in axenic culture. Facilitates the uptake of these lipids by stabilizing protein subunits of the Mce1 and Mce4 multi-subunit transporters, which transport fatty acids and cholesterol, respectively. Required for full virulence in vivo. {ECO:0000269|PubMed:28708968}.", "FUNCTION: This protein is involved in the repair of mismatches in DNA. It is possible that it carries out the mismatch recognition step. This protein has a weak ATPase activity. {ECO:0000255|HAMAP-Rule:MF_00096}.", "FUNCTION: Catalyzes the conversion of glucosamine-6-phosphate to glucosamine-1-phosphate. {ECO:0000255|HAMAP-Rule:MF_01554}.", "FUNCTION: Plays a major role in assembly and budding of virion. Completely covers the ribonucleoprotein coil and keep it in condensed bullet-shaped form. Inhibits viral transcription and stimulates replication (By similarity). {ECO:0000250}.", "FUNCTION: Involved in the biosynthesis of isoprenoids. Catalyzes the 1,3-allylic rearrangement of the homoallylic substrate isopentenyl (IPP) to its allylic isomer, dimethylallyl diphosphate (DMAPP). {ECO:0000255|HAMAP-Rule:MF_00354}.", "FUNCTION: Catalyzes the NADPH-dependent reduction of N-acetyl-5-glutamyl phosphate to yield N-acetyl-L-glutamate 5-semialdehyde. {ECO:0000255|HAMAP-Rule:MF_00150}.", "FUNCTION: Catalyzes the synthesis of activated sulfate.", "FUNCTION: Component of the SOSS complex, a multiprotein complex that functions downstream of the MRN complex to promote DNA repair and G2/M checkpoint. In the SOSS complex, acts as a sensor of single-stranded DNA that binds to single-stranded DNA. The SOSS complex associates with DNA lesions and influences diverse endpoints in the cellular DNA damage response including cell-cycle checkpoint activation, recombinational repair and maintenance of genomic stability. Required for efficient homologous recombination-dependent repair of double-strand breaks (DSBs) (By similarity). {ECO:0000250}.", "FUNCTION: S-adenosyl-L-methionine-dependent methyltransferase that catalyzes the trimethylation of the amino group of the modified target histidine residue in translation elongation factor 2 (EF-2), to form an intermediate called diphthine. The three successive methylation reactions represent the second step of diphthamide biosynthesis. {ECO:0000255|HAMAP-Rule:MF_01084}.", "FUNCTION: Catalyzes the attachment of alanine to tRNA(Ala) in a two-step reaction: alanine is first activated by ATP to form Ala-AMP and then transferred to the acceptor end of tRNA(Ala). Also edits incorrectly charged Ser-tRNA(Ala) and Gly-tRNA(Ala) via its editing domain. {ECO:0000255|HAMAP-Rule:MF_00036}.", "FUNCTION: Located on the platform of the 30S subunit, it bridges several disparate RNA helices of the 16S rRNA. Forms part of the Shine-Dalgarno cleft in the 70S ribosome. {ECO:0000255|HAMAP-Rule:MF_01310}.", "FUNCTION: Catalyzes the acyloin condensation reaction between C atoms 2 and 3 of pyruvate and glyceraldehyde 3-phosphate to yield 1-deoxy-D-xylulose-5-phosphate (DXP). {ECO:0000255|HAMAP-Rule:MF_00315}.", "FUNCTION: One of the essential components for the initiation of protein synthesis. Stabilizes the binding of IF-2 and IF-3 on the 30S subunit to which N-formylmethionyl-tRNA(fMet) subsequently binds. Helps modulate mRNA selection, yielding the 30S pre-initiation complex (PIC). Upon addition of the 50S ribosomal subunit IF-1, IF-2 and IF-3 are released leaving the mature 70S translation initiation complex. {ECO:0000255|HAMAP-Rule:MF_00075}.", "FUNCTION: Protein-histidine N-methyltransferase that specifically mediates 3-methylhistidine (tele-methylhistidine) methylation of actin at 'His-73'. Does not have protein-lysine N-methyltransferase activity and probably only catalyzes histidine methylation of actin. {ECO:0000250|UniProtKB:Q86TU7}.", "FUNCTION: Required for maturation of urease via the functional incorporation of the urease nickel metallocenter. {ECO:0000255|HAMAP-Rule:MF_01385}.", "FUNCTION: Terpene cyclase that catalyzes the cyclization of farnesyl diphosphate (FPP) to delta(6)-protoilludene (PubMed:24166732, PubMed:26239156). In presence of Ca(2+), a significant switch from 1,11 to a dual 1,11/1,10 cyclization occurs, producing beta-elemene as the major product, with lower levels of delta(6)-protoilludene and (E)-beta-caryophyllene, and traces of beta-selinene and alpha-selinene (PubMed:26239156). {ECO:0000269|PubMed:24166732, ECO:0000269|PubMed:26239156}.", "FUNCTION: Catalyzes the N-acylation of UDP-3-O-acylglucosamine using 3-hydroxyacyl-ACP as the acyl donor. Is involved in the biosynthesis of lipid A, a phosphorylated glycolipid that anchors the lipopolysaccharide to the outer membrane of the cell. {ECO:0000255|HAMAP-Rule:MF_00523}.", "FUNCTION: Releases the N-terminal proline from various substrates. Cleaves Pro-betaNA (L-prolyl-beta-naphthylamide) effectively. {ECO:0000269|PubMed:8025678}.", "FUNCTION: Catalyzes the condensation reaction of fatty acid synthesis by the addition to an acyl acceptor of two carbons from malonyl-ACP. Catalyzes the first condensation reaction which initiates fatty acid synthesis and may therefore play a role in governing the total rate of fatty acid production. Possesses both acetoacetyl-ACP synthase and acetyl transacylase activities. Its substrate specificity determines the biosynthesis of branched-chain and/or straight-chain of fatty acids. {ECO:0000255|HAMAP-Rule:MF_01815}.", "FUNCTION: Involved in transcription antitermination. Required for transcription of ribosomal RNA (rRNA) genes. Binds specifically to the boxA antiterminator sequence of the ribosomal RNA (rrn) operons. {ECO:0000255|HAMAP-Rule:MF_00073}.", "FUNCTION: Catalyzes the reversible conversion of 2-phosphoglycerate (2-PG) into phosphoenolpyruvate (PEP). It is essential for the degradation of carbohydrates via glycolysis. {ECO:0000255|HAMAP-Rule:MF_00318}.", "FUNCTION: Efflux pump; part of the gene cluster that mediates the biosynthesis of patulin, an acetate-derived tetraketide mycotoxin produced by several fungal species that shows antimicrobial properties against several bacteria (PubMed:19383676). May be involved in the secretion of E-ascladiol to be converted to patulin by the secreted patulin synthase patE (By similarity). {ECO:0000250|UniProtKB:A0A075TRA9, ECO:0000269|PubMed:19383676}.", "FUNCTION: Capsid protein self-assembles to form an icosahedral capsid with a T=1 symmetry, about 22 nm in diameter, and consisting of 60 copies of two size variants of the capsid proteins, VP1 and VP2, which differ by the presence of an N-terminal extension in the minor protein VP1. The capsid encapsulates the genomic ssDNA. Capsid proteins are responsible for the attachment to host cell receptor TFRC. This attachment induces virion internalization predominantly through clathrin-endocytosis. Binding to the host receptors also induces capsid rearrangements leading to surface exposure of VP1 N-terminus, specifically its phospholipase A2-like region and nuclear localization signal(s). VP1 N-terminus might serve as a lipolytic enzyme to breach the endosomal membrane during entry into host cell. Intracytoplasmic transport involves microtubules and interaction between capsid proteins and host dynein. Exposure of nuclear localization signal probably allows nuclear import of capsids (By similarity). {ECO:0000250}.", "FUNCTION: This protein is one of the two subunits of integration host factor, a specific DNA-binding protein that functions in genetic recombination as well as in transcriptional and translational control. {ECO:0000255|HAMAP-Rule:MF_00380}.", "FUNCTION: Lethal factor (LF), which constitutes one of the three proteins composing the anthrax toxin, is able to trigger rapid cell death in macrophages (PubMed:10475971, PubMed:11104681, PubMed:3711080, PubMed:8380282, PubMed:9563949, PubMed:9703991). Acts as a protease that cleaves the N-terminal of most dual specificity mitogen-activated protein kinase kinases (MAPKKs or MAP2Ks) (except for MAP2K5): cleavage invariably occurs within the N-terminal proline-rich region preceding the kinase domain, thus disrupting a sequence involved in directing specific protein-protein interactions necessary for the assembly of signaling complexes (PubMed:10475971, PubMed:11104681, PubMed:14718925, PubMed:9563949, PubMed:9703991). Also cleaves mouse Nlrp1b: host Nlrp1b cleavage promotes ubiquitination and degradation of the N-terminal part of Nlrp1b by the proteasome, thereby releasing the cleaved C-terminal part of Nlrp1b, which polymerizes and forms the Nlrp1b inflammasome followed by host cell pyroptosis (PubMed:10338520, PubMed:19651869, PubMed:30872531, PubMed:31268597). Able to cleave mouse Nlrp1b alleles 1 and 5, while it is not able to cleave Nlrp1b alleles 2, 3 and 4 (PubMed:16429160, PubMed:19651869). In contrast, does not cleave NLRP1 human ortholog (PubMed:19651869). LF is not toxic by itself and only acts as a lethal factor when associated with protective antigen (PA) to form the lethal toxin (LeTx): PA is required for LF translocation into the host cytosol (PubMed:10475971, PubMed:11104681, PubMed:9563949, PubMed:9703991). {ECO:0000269|PubMed:10338520, ECO:0000269|PubMed:10475971, ECO:0000269|PubMed:11104681, ECO:0000269|PubMed:14718925, ECO:0000269|PubMed:16429160, ECO:0000269|PubMed:19651869, ECO:0000269|PubMed:30872531, ECO:0000269|PubMed:31268597, ECO:0000269|PubMed:3711080, ECO:0000269|PubMed:8380282, ECO:0000269|PubMed:9563949, ECO:0000269|PubMed:9703991}.", "FUNCTION: Produces ATP from ADP in the presence of a proton gradient across the membrane. The alpha chain is a regulatory subunit. {ECO:0000255|HAMAP-Rule:MF_01346}.", "FUNCTION: Core subunit of the mitochondrial membrane respiratory chain NADH dehydrogenase (Complex I) that is believed to belong to the minimal assembly required for catalysis. Complex I functions in the transfer of electrons from NADH to the respiratory chain. The immediate electron acceptor for the enzyme is believed to be ubiquinone (By similarity). {ECO:0000250}.", "FUNCTION: Catalyzes the phosphorylation of the 3'-hydroxyl group of dephosphocoenzyme A to form coenzyme A. {ECO:0000255|HAMAP-Rule:MF_00376}.", "FUNCTION: Functions as a scaffold that mediates the ordered assembly of spliceosomal proteins and snRNAs. Required for the assembly of the U4/U6-U5 tri-snRNP complex. Functions as a scaffold that positions spliceosomal U2, U5 and U6 snRNAs at splice sites on pre-mRNA substrates, so that splicing can occur. Interacts with both the 5' and the 3' splice site. {ECO:0000250|UniProtKB:Q99PV0}.", "FUNCTION: One of the primary rRNA binding proteins, it binds directly to 16S rRNA where it nucleates assembly of the body of the 30S subunit. {ECO:0000255|HAMAP-Rule:MF_01306}.; FUNCTION: With S5 and S12 plays an important role in translational accuracy. {ECO:0000255|HAMAP-Rule:MF_01306}.", "FUNCTION: Catalyzes the ATP-dependent amination of UTP to CTP with either L-glutamine or ammonia as the source of nitrogen. Regulates intracellular CTP levels through interactions with the four ribonucleotide triphosphates. {ECO:0000255|HAMAP-Rule:MF_01227}.", "FUNCTION: Necessary for the splicing of pre-mRNA. Has a role in the recognition of the branch site (5'-UACUAAC-3'), the pyrimidine tract and the 3'-splice site at the 3'-end of introns (By similarity). {ECO:0000250}.", "FUNCTION: Plays a role in the initiation of viral DNA replication. A dimer of E2 interacts with a dimer of E1 in order to improve specificity of E1 DNA binding activity. Once the complex recognizes and binds DNA at specific sites, the E2 dimer is removed from DNA. E2 also regulates viral transcription through binding to the E2RE response element (5'-ACCNNNNNNGGT-3') present in multiple copies in the regulatory regions of the viral genome. Activates or represses transcription depending on E2RE's position with regards to proximal promoter elements including the TATA-box. Repression occurs by sterically hindering the assembly of the transcription initiation complex. {ECO:0000255|HAMAP-Rule:MF_04001}.", "FUNCTION: Ligand for members of the frizzled family of seven transmembrane receptors (By similarity). Shares much functionality with wnt11b. Signals through a non-canonical Wnt pathway to activate Jun-N-terminal kinase (JNK) to regulate gastrulation movements. Acts in a non-cell-autonomous manner to control neural crest migration, probably acting as an extracellular signal from surrounding tissue, but is not required for neural crest induction. Acts redundantly with wnt11b during pronephros induction. Regulates cardiac morphogenesis through the activation of JNK, but is not required for cardiac differentiation. Essential for dorsal fin development; required for an epithelial to mesenchymal transformation event prior to migration of cells into the fin, and ultimately for maintenance of fin structure. Mediates dorsal fin development through a non-canonical pathway mediated by Ca(2+). {ECO:0000250, ECO:0000269|PubMed:15708567, ECO:0000269|PubMed:17240368, ECO:0000269|PubMed:18942153, ECO:0000269|PubMed:19582868}.", "FUNCTION: E3 ubiquitin-protein ligase component of the GID E3 ligase complex recruiting N termini and catalyzing ubiquitination of proteins targeted for degradation. GID E3 is regulated through assembly with interchangeable N-degron-binding substrate receptors induced by distinct environmental perturbations. Required for the adaptation to the presence of glucose in the growth medium; mediates in association with the substrate receptor VID24/GID4 the degradation of enzymes involved in gluconeogenesis when cells are shifted to glucose-containing medium. {ECO:0000250|UniProtKB:Q12508}.", "FUNCTION: Synthesizes alpha-1,4-glucan chains using ADP-glucose. {ECO:0000255|HAMAP-Rule:MF_00484}.", "FUNCTION: One of the primary rRNA binding proteins, it binds directly to 16S rRNA where it helps nucleate assembly of the platform of the 30S subunit by binding and bridging several RNA helices of the 16S rRNA. {ECO:0000255|HAMAP-Rule:MF_01343}.; FUNCTION: Forms an intersubunit bridge (bridge B4) with the 23S rRNA of the 50S subunit in the ribosome. {ECO:0000255|HAMAP-Rule:MF_01343}.", "FUNCTION: Receptor for the C-X-C chemokine CXCL12/SDF-1 that transduces a signal by increasing intracellular calcium ion levels and enhancing MAPK1/MAPK3 activation (PubMed:8962122, PubMed:9103415, PubMed:9295051). Involved in the AKT signaling cascade (By similarity). Plays a role in regulation of cell migration, e.g. during wound healing. Acts as a receptor for extracellular ubiquitin; leading to enhanced intracellular calcium ions and reduced cellular cAMP levels. Binds bacterial lipopolysaccharide (LPS) et mediates LPS-induced inflammatory response, including TNF secretion by monocytes (By similarity). Involved in hematopoiesis and in cardiac ventricular septum formation (PubMed:9634237, PubMed:9634238, PubMed:9689100). Also plays an essential role in vascularization of the gastrointestinal tract, probably by regulating vascular branching and/or remodeling processes in endothelial cells (PubMed:9634237). Involved in cerebellar development. In the CNS, could mediate hippocampal-neuron survival (PubMed:9634238, PubMed:9689100). {ECO:0000250|UniProtKB:P61073, ECO:0000269|PubMed:8962122, ECO:0000269|PubMed:9103415, ECO:0000269|PubMed:9295051, ECO:0000269|PubMed:9634237, ECO:0000269|PubMed:9634238, ECO:0000269|PubMed:9689100}.", "FUNCTION: Major lipase in white adipose tissue (By similarity). Involved in the metabolism of xenobiotics and of natural substrates. Hydrolyzes triacylglycerols and monoacylglycerols, with a preference for monoacylglycerols. The susceptibility of the substrate increases with decreasing acyl chain length of the fatty acid moiety. Catalyzes the synthesis of fatty acid ethyl esters (PubMed:1429692). Hydrolyzes retinyl esters (PubMed:12230550). {ECO:0000250|UniProtKB:Q8VCT4, ECO:0000269|PubMed:12230550, ECO:0000269|PubMed:1429692}.", "FUNCTION: Forms a chaperone-bound H2A.Z-H2B complex that acts as a source for SWR1 complex-dependent H2A to H2A.Z histone replacement in chromatin. {ECO:0000250}.", "FUNCTION: May protect the nitrogenase Fe-Mo protein from oxidative damage. {ECO:0000250}.", "FUNCTION: Probable transcriptional regulator. {ECO:0000250}."]